tangyangguang/Esp32Base/test/test_native_mqtt_harness/test_main.cpp
void test_configuration_requires_ca_and_rejects_plaintext_by_default() {
    Esp32BaseMqtt::ConnectionConfig config = validConfig();
    config.tls.caCertificatePem = nullptr;
    config.tls.caCertificateLength = 0;
    TEST_ASSERT_FALSE(Esp32BaseMqtt::configure(config));
    TEST_ASSERT_EQUAL(Esp32BaseMqtt::CONFIGURATION_ERROR,
                      Esp32BaseMqtt::state());

    resetModule();
    config = validConfig();
    config.tls.caCertificateLength =
        ESP32BASE_MQTT_MAX_CA_CERT_BYTES + 1;
    TEST_ASSERT_FALSE(Esp32BaseMqtt::configure(config));

    resetModule();
    static const char disableVerification[] = "NULL";
    config = validConfig();
    config.tls.caCertificatePem = disableVerification;
    config.tls.caCertificateLength = sizeof(disableVerification);
    TEST_ASSERT_FALSE(Esp32BaseMqtt::configure(config));

    resetModule();
    config = validConfig();
    config.security = Esp32BaseMqtt::EXPLICIT_PLAINTEXT;
    config.tls = {};
    TEST_ASSERT_FALSE(Esp32BaseMqtt::configure(config));
}

void test_begin_never_starts_network_and_waits_for_prerequisites() {
    TEST_ASSERT_TRUE(Esp32BaseMqtt::configure(validConfig()));
    TEST_ASSERT_TRUE(Esp32BaseMqtt::begin());
    TEST_ASSERT_NULL(g_fakeEventHandler);

    Esp32BaseMqtt::handle(false);
    TEST_ASSERT_EQUAL(Esp32BaseMqtt::WAITING_FOR_WIFI,
                      Esp32BaseMqtt::state());

    g_fakeWifiConnected = true;
    Esp32BaseMqtt::handle(false);
    TEST_ASSERT_EQUAL(Esp32BaseMqtt::WAITING_FOR_TIME,
                      Esp32BaseMqtt::state());

    g_fakeRealTime = true;
    Esp32BaseTime::g_source = Esp32BaseTime::SOURCE_RTC;
    Esp32BaseMqtt::handle(false);
    TEST_ASSERT_EQUAL(Esp32BaseMqtt::WAITING_FOR_TIME,
                      Esp32BaseMqtt::state());

    Esp32BaseTime::g_source = Esp32BaseTime::SOURCE_NTP;
    Esp32BaseMqtt::handle(false);
    TEST_ASSERT_EQUAL(Esp32BaseMqtt::CONNECTING,
                      Esp32BaseMqtt::state());
}

void test_callbacks_are_deferred_until_handle_and_subscriptions_repeat() {
    Esp32BaseMqtt::Subscription subscription;
    subscription.topicFilter = "device/+/command";
    subscription.qos = Esp32BaseMqtt::QOS_1;
    TEST_ASSERT_TRUE(Esp32BaseMqtt::addSubscription(subscription));
    Esp32BaseMqtt::setEventCallback(onEvent);
    startAndConnect();
    TEST_ASSERT_EQUAL(1, g_fakeSubscribeCount);
    TEST_ASSERT_EQUAL(1, g_applicationEventCount);

    char rejectedQos = static_cast<char>(0x80);
    esp_mqtt_event_t rejected = {};
    rejected.client = &g_fakeClient;
    rejected.msg_id = g_mqttSubscriptions[0].pendingPacketId;
    rejected.data = &rejectedQos;
    rejected.data_len = 1;
    g_fakeEventHandler(nullptr, nullptr, MQTT_EVENT_SUBSCRIBED, &rejected);
    TEST_ASSERT_EQUAL(1, g_applicationEventCount);
    Esp32BaseMqtt::handle(false);
    TEST_ASSERT_EQUAL(2, g_applicationEventCount);
    TEST_ASSERT_EQUAL(0,
                      Esp32BaseMqtt::diagnostics().subscriptionAcknowledged);

    emitEvent(MQTT_EVENT_DISCONNECTED);
    TEST_ASSERT_EQUAL(2, g_applicationEventCount);
    Esp32BaseMqtt::handle(false);
    TEST_ASSERT_EQUAL(Esp32BaseMqtt::BACKOFF, Esp32BaseMqtt::state());

    g_fakeMillis = g_mqttNextAttemptMs;
    Esp32BaseMqtt::handle(false);
    emitEvent(MQTT_EVENT_BEFORE_CONNECT);
    emitEvent(MQTT_EVENT_CONNECTED);
    TEST_ASSERT_EQUAL(3, g_applicationEventCount);
    Esp32BaseMqtt::handle(false);
    TEST_ASSERT_EQUAL(2, g_fakeSubscribeCount);
    TEST_ASSERT_TRUE(g_applicationEventCount >= 4);
}

void test_qos1_publish_ack_and_outbox_limit() {
    Esp32BaseMqtt::setEventCallback(onEvent);
    startAndConnect();
    const uint8_t payload[] = {1, 2, 3};
    Esp32BaseMqtt::PublishRequest request;
    request.topic = "device/state";
    request.payload = payload;
    request.payloadLength = sizeof(payload);
    request.qos = Esp32BaseMqtt::QOS_1;
    const Esp32BaseMqtt::PublishResult result = Esp32BaseMqtt::publish(request);
    TEST_ASSERT_TRUE(result.accepted());
    TEST_ASSERT_EQUAL(1, Esp32BaseMqtt::diagnostics().inflightQos1);

    emitEvent(MQTT_EVENT_PUBLISHED, result.packetId);
    TEST_ASSERT_EQUAL(1, Esp32BaseMqtt::diagnostics().inflightQos1);
    Esp32BaseMqtt::handle(false);
    TEST_ASSERT_EQUAL(0, Esp32BaseMqtt::diagnostics().inflightQos1);
    TEST_ASSERT_EQUAL(1, Esp32BaseMqtt::diagnostics().publishAcknowledged);

    g_fakeOutboxBytes = ESP32BASE_MQTT_MAX_OUTBOX_BYTES;
    TEST_ASSERT_EQUAL(Esp32BaseMqtt::PUBLISH_OUTBOX_FULL,
                      Esp32BaseMqtt::publish(request).code);
    g_fakeOutboxBytes = 0;

    const Esp32BaseMqtt::PublishResult uncertain =
        Esp32BaseMqtt::publish(request);
    TEST_ASSERT_TRUE(uncertain.accepted());
    g_tryPublishOnUncertain = true;
    emitEvent(MQTT_EVENT_DISCONNECTED);
    Esp32BaseMqtt::handle(false);
    TEST_ASSERT_EQUAL(0, Esp32BaseMqtt::diagnostics().inflightQos1);
    TEST_ASSERT_EQUAL(
        1, Esp32BaseMqtt::diagnostics().publishDeliveryUncertain);
    TEST_ASSERT_EQUAL(Esp32BaseMqtt::PUBLISH_NOT_CONNECTED,
                      g_reentrantPublishCode);
}

void test_fragment_assembly_and_oversize_drop() {
    Esp32BaseMqtt::setMessageCallback(onMessage);
    startAndConnect();
    char topic[] = "device/command";
    char first[] = "abc";
    char second[] = "def";
    esp_mqtt_event_t event = {};
    event.client = &g_fakeClient;
    event.event_id = MQTT_EVENT_DATA;
    event.msg_id = 55;
    event.topic = topic;
    event.topic_len = strlen(topic);
    event.data = first;
    event.data_len = 3;
    event.total_data_len = 6;
    event.current_data_offset = 0;
    g_fakeEventHandler(nullptr, nullptr, MQTT_EVENT_DATA, &event);
    TEST_ASSERT_EQUAL(0, g_messageCount);

    event.topic = nullptr;
    event.topic_len = 0;
    event.data = second;
    event.current_data_offset = 3;
    g_fakeEventHandler(nullptr, nullptr, MQTT_EVENT_DATA, &event);
    TEST_ASSERT_EQUAL(0, g_messageCount);
    Esp32BaseMqtt::handle(false);
    TEST_ASSERT_EQUAL(1, g_messageCount);
    TEST_ASSERT_EQUAL(6, g_lastPayloadLength);
    TEST_ASSERT_EQUAL_STRING("device/command", g_lastTopic);

