tangyangguang/Esp32Base/test/test_native_mqtt_harness/test_main.cpp
    event.msg_id = 56;
    event.topic = topic;
    event.topic_len = strlen(topic);
    event.total_data_len = ESP32BASE_MQTT_MAX_PAYLOAD_BYTES + 1;
    event.current_data_offset = 0;
    g_fakeEventHandler(nullptr, nullptr, MQTT_EVENT_DATA, &event);
    Esp32BaseMqtt::handle(false);
    TEST_ASSERT_EQUAL(1, g_messageCount);
    TEST_ASSERT_EQUAL(1, Esp32BaseMqtt::diagnostics().incomingOversizeDropped);

    event.msg_id = 57;
    event.total_data_len = INT_MAX;
    event.current_data_offset = INT_MAX;
    event.data_len = INT_MAX;
    g_fakeEventHandler(nullptr, nullptr, MQTT_EVENT_DATA, &event);
    Esp32BaseMqtt::handle(false);
    TEST_ASSERT_EQUAL(1, g_messageCount);
    TEST_ASSERT_EQUAL(2, Esp32BaseMqtt::diagnostics().incomingOversizeDropped);
}

void test_terminal_auth_rejection_requires_explicit_retry() {
    startAndConnect();
    esp_mqtt_error_codes_t error = {};
    error.error_type = MQTT_ERROR_TYPE_CONNECTION_REFUSED;
    error.connect_return_code = MQTT_CONNECTION_REFUSE_NOT_AUTHORIZED;
    emitEvent(MQTT_EVENT_ERROR, 0, &error);
    emitEvent(MQTT_EVENT_DISCONNECTED);
    Esp32BaseMqtt::handle(false);
    TEST_ASSERT_EQUAL(Esp32BaseMqtt::CONNECTION_REJECTED,
                      Esp32BaseMqtt::state());
    TEST_ASSERT_EQUAL(Esp32BaseMqtt::ERROR_NOT_AUTHORIZED,
                      Esp32BaseMqtt::status().lastError);
    TEST_ASSERT_TRUE(Esp32BaseMqtt::requestReconnect());
    Esp32BaseMqtt::handle(false);
    TEST_ASSERT_EQUAL(Esp32BaseMqtt::BACKOFF, Esp32BaseMqtt::state());
}

void test_lwt_is_mapped_and_ota_suspends_without_direct_callback() {
    static const uint8_t willPayload[] = "offline";
    Esp32BaseMqtt::LastWill will;
    will.topic = "device/availability";
    will.payload = willPayload;
    will.payloadLength = sizeof(willPayload) - 1;
    will.qos = Esp32BaseMqtt::QOS_1;
    will.retain = true;
    Esp32BaseMqtt::ConnectionConfig config = validConfig();
    config.lastWill = &will;
    TEST_ASSERT_TRUE(Esp32BaseMqtt::configure(config));
    Esp32BaseMqtt::setEventCallback(onEvent);
    TEST_ASSERT_TRUE(Esp32BaseMqtt::begin());
    g_fakeWifiConnected = true;
    g_fakeRealTime = true;
    Esp32BaseMqtt::handle(false);
    TEST_ASSERT_EQUAL_STRING("device/availability", g_lastNativeConfig.lwt_topic);
    TEST_ASSERT_EQUAL(7, g_lastNativeConfig.lwt_msg_len);
    TEST_ASSERT_EQUAL(1, g_lastNativeConfig.lwt_qos);
    TEST_ASSERT_EQUAL(1, g_lastNativeConfig.lwt_retain);

    emitEvent(MQTT_EVENT_CONNECTED);
    TEST_ASSERT_EQUAL(0, g_applicationEventCount);
    Esp32BaseMqtt::handle(false);
    TEST_ASSERT_EQUAL(1, g_applicationEventCount);
    Esp32BaseMqtt::handle(true);
    TEST_ASSERT_EQUAL(Esp32BaseMqtt::SUSPENDED_FOR_OTA,
                      Esp32BaseMqtt::state());
    TEST_ASSERT_EQUAL(1, g_applicationEventCount);
    TEST_ASSERT_EQUAL(1, g_fakeDisconnectCount);
    TEST_ASSERT_EQUAL(0, g_fakeStopCount);
    emitEvent(MQTT_EVENT_DISCONNECTED);
    Esp32BaseMqtt::handle(true);
    TEST_ASSERT_EQUAL(2, g_applicationEventCount);
    TEST_ASSERT_EQUAL(Esp32BaseMqtt::SUSPENDED_FOR_OTA,
                      Esp32BaseMqtt::state());
}

void test_before_connect_refreshes_lwt_for_every_attempt() {
    Esp32BaseMqtt::LastWill will;
    will.topic = "device/availability";
    will.payload = reinterpret_cast<const uint8_t*>(g_dynamicWillPayload);
    will.payloadLength = 0;
    will.qos = Esp32BaseMqtt::QOS_1;
    will.retain = true;
    g_dynamicWill = &will;

    Esp32BaseMqtt::ConnectionConfig config = validConfig();
    config.lastWill = &will;
    TEST_ASSERT_TRUE(Esp32BaseMqtt::configure(config));
    TEST_ASSERT_TRUE(
        Esp32BaseMqtt::setBeforeConnectCallback(beforeConnect));
    TEST_ASSERT_TRUE(Esp32BaseMqtt::begin());
    g_fakeWifiConnected = true;
    g_fakeRealTime = true;

    Esp32BaseMqtt::handle(false);
    TEST_ASSERT_EQUAL(1, g_beforeConnectCount);
    TEST_ASSERT_EQUAL_STRING("offline-1", g_lastWillPayload);
    emitEvent(MQTT_EVENT_BEFORE_CONNECT);
    TEST_ASSERT_EQUAL(1, g_fakeSetConfigCount);
    TEST_ASSERT_EQUAL_STRING("offline-1", g_lastWillPayload);
    emitEvent(MQTT_EVENT_CONNECTED);
    Esp32BaseMqtt::handle(false);

    emitEvent(MQTT_EVENT_DISCONNECTED);
    Esp32BaseMqtt::handle(false);
    g_fakeMillis = g_mqttNextAttemptMs;
    Esp32BaseMqtt::handle(false);
    TEST_ASSERT_EQUAL(2, g_beforeConnectCount);
    emitEvent(MQTT_EVENT_BEFORE_CONNECT);
    TEST_ASSERT_EQUAL(2, g_fakeSetConfigCount);
    TEST_ASSERT_EQUAL_STRING("offline-2", g_lastWillPayload);
}

void test_before_connect_output_is_revalidated() {
    Esp32BaseMqtt::LastWill will;
    will.topic = "device/availability";
    will.payload = reinterpret_cast<const uint8_t*>(g_dynamicWillPayload);
    will.payloadLength = 0;
    will.qos = Esp32BaseMqtt::QOS_1;
    will.retain = true;
    g_dynamicWill = &will;
    g_makeDynamicWillInvalid = true;

    Esp32BaseMqtt::ConnectionConfig config = validConfig();
    config.lastWill = &will;
    TEST_ASSERT_TRUE(Esp32BaseMqtt::configure(config));
    TEST_ASSERT_TRUE(
        Esp32BaseMqtt::setBeforeConnectCallback(beforeConnect));
    TEST_ASSERT_TRUE(Esp32BaseMqtt::begin());
    g_fakeWifiConnected = true;
    g_fakeRealTime = true;

    Esp32BaseMqtt::handle(false);
    TEST_ASSERT_EQUAL(Esp32BaseMqtt::CONFIGURATION_ERROR,
                      Esp32BaseMqtt::state());
    TEST_ASSERT_EQUAL(Esp32BaseMqtt::ERROR_INVALID_CONFIGURATION,
                      Esp32BaseMqtt::status().lastError);
    TEST_ASSERT_EQUAL_UINT32(
        1,
        Esp32BaseMqtt::diagnostics().connectionConfigurationFailures);
    TEST_ASSERT_EQUAL_UINT32(0,
                             Esp32BaseMqtt::diagnostics().connectAttempts);
    TEST_ASSERT_NULL(g_fakeEventHandler);
}

void test_native_before_connect_update_failure_is_terminal_until_retry() {
    startAndConnect();
    emitEvent(MQTT_EVENT_DISCONNECTED);
    Esp32BaseMqtt::handle(false);
    g_fakeMillis = g_mqttNextAttemptMs;
    Esp32BaseMqtt::handle(false);
    for (uint8_t i = 0; i < ESP32BASE_MQTT_EVENT_SLOTS; ++i) {
        RawEvent queued;
        queued.type = RAW_PUBLISHED;
        queued.packetId = static_cast<int32_t>(100 + i);
        TEST_ASSERT_TRUE(pushRawEvent(queued));
    }
    const int subscriptionsBeforeFailure = g_fakeSubscribeCount;
    g_fakeSetConfigResult = ESP_ERR_NO_MEM;
    emitEvent(MQTT_EVENT_BEFORE_CONNECT);
    TEST_ASSERT_FALSE(isConnectionWanted());
    emitEvent(MQTT_EVENT_CONNECTED);
    TEST_ASSERT_EQUAL(subscriptionsBeforeFailure, g_fakeSubscribeCount);
    Esp32BaseMqtt::handle(false);

    TEST_ASSERT_EQUAL(Esp32BaseMqtt::CONFIGURATION_ERROR,
                      Esp32BaseMqtt::state());
    TEST_ASSERT_EQUAL(Esp32BaseMqtt::ERROR_NO_MEMORY,
                      Esp32BaseMqtt::status().lastError);
    TEST_ASSERT_EQUAL_UINT32(
        1,
        Esp32BaseMqtt::diagnostics().connectionConfigurationFailures);
    TEST_ASSERT_EQUAL_UINT32(
        1,
        Esp32BaseMqtt::diagnostics().controlEventDropped);
    TEST_ASSERT_TRUE(Esp32BaseMqtt::requestReconnect());
    g_fakeSetConfigResult = ESP_OK;
    Esp32BaseMqtt::handle(false);
    TEST_ASSERT_EQUAL(Esp32BaseMqtt::BACKOFF, Esp32BaseMqtt::state());
}

void test_incoming_mailbox_full_drops_whole_message() {
    Esp32BaseMqtt::setMessageCallback(onMessage);
    Esp32BaseMqtt::setEventCallback(onEvent);
    startAndConnect();
    g_applicationEventCount = 0;
    char topic[] = "device/command";
    char payload[] = "x";
    for (int packetId = 1; packetId <= 3; ++packetId) {
        esp_mqtt_event_t event = {};
        event.client = &g_fakeClient;
        event.event_id = MQTT_EVENT_DATA;
        event.msg_id = packetId;
        event.topic = topic;
        event.topic_len = strlen(topic);
        event.data = payload;
        event.data_len = 1;
        event.total_data_len = 1;
        event.current_data_offset = 0;
        g_fakeEventHandler(nullptr, nullptr, MQTT_EVENT_DATA, &event);
    }
    TEST_ASSERT_EQUAL(0, g_messageCount);
    TEST_ASSERT_EQUAL(1, Esp32BaseMqtt::diagnostics().incomingMailboxDropped);
    Esp32BaseMqtt::handle(false);
    TEST_ASSERT_EQUAL(2, g_messageCount);
    TEST_ASSERT_EQUAL(1, g_applicationEventCount);
}

