tangyangguang/Esp32Base/test/test_native_mqtt_harness/test_main.cpp
void test_connection_event_survives_full_control_mailbox() {
    startAndConnect();
    for (int i = 0; i < ESP32BASE_MQTT_EVENT_SLOTS; ++i) {
        emitEvent(MQTT_EVENT_PUBLISHED, 100 + i);
    }
    emitEvent(MQTT_EVENT_DISCONNECTED);
    TEST_ASSERT_EQUAL(1, Esp32BaseMqtt::diagnostics().controlEventDropped);
    Esp32BaseMqtt::handle(false);
    TEST_ASSERT_EQUAL(Esp32BaseMqtt::BACKOFF, Esp32BaseMqtt::state());
}

void test_dns_and_certificate_errors_are_distinguished() {
    startAndConnect();
    esp_mqtt_error_codes_t dnsError = {};
    dnsError.error_type = MQTT_ERROR_TYPE_TCP_TRANSPORT;
    dnsError.esp_tls_last_esp_err =
        ESP_ERR_ESP_TLS_CANNOT_RESOLVE_HOSTNAME;
    emitEvent(MQTT_EVENT_ERROR, 0, &dnsError);
    emitEvent(MQTT_EVENT_DISCONNECTED);
    Esp32BaseMqtt::handle(false);
    TEST_ASSERT_EQUAL(Esp32BaseMqtt::ERROR_DNS_OR_TRANSPORT,
                      Esp32BaseMqtt::status().lastError);

    RawEvent certificateError;
    certificateError.type = RAW_ERROR;
    certificateError.certificateFlags = 1;
    bool terminal = false;
    TEST_ASSERT_EQUAL(Esp32BaseMqtt::ERROR_TLS_CERTIFICATE,
                      classifyError(certificateError, terminal));
    TEST_ASSERT_TRUE(terminal);
}

void test_reports_platform_certificate_date_check_capability() {
    TEST_ASSERT_TRUE(Esp32BaseMqtt::configure(validConfig()));
    const Esp32BaseMqtt::Status status = Esp32BaseMqtt::status();
    TEST_ASSERT_TRUE(status.tls);
    TEST_ASSERT_FALSE(status.certificateDateCheckEnabled);
    TEST_ASSERT_EQUAL_STRING(
        "tls_certificate_date_check_unavailable",
        Esp32BaseMqtt::errorName(
            Esp32BaseMqtt::ERROR_TLS_CERTIFICATE_DATE_CHECK_UNAVAILABLE));
}

void test_secure_default_rejects_missing_certificate_date_check() {
    TEST_ASSERT_FALSE(Esp32BaseMqtt::configure(validConfig()));
    const Esp32BaseMqtt::Status status = Esp32BaseMqtt::status();
    TEST_ASSERT_FALSE(status.configured);
    TEST_ASSERT_FALSE(status.certificateDateCheckEnabled);
    TEST_ASSERT_EQUAL(
        Esp32BaseMqtt::ERROR_TLS_CERTIFICATE_DATE_CHECK_UNAVAILABLE,
        status.lastError);
}

void test_terminal_rejection_survives_wifi_loss_and_recovery() {
    TEST_ASSERT_TRUE(Esp32BaseMqtt::configure(validConfig()));
    TEST_ASSERT_TRUE(Esp32BaseMqtt::begin());
    g_fakeWifiConnected = true;
    g_fakeRealTime = true;
    Esp32BaseMqtt::handle(false);

    esp_mqtt_error_codes_t authError = {};
    authError.error_type = MQTT_ERROR_TYPE_CONNECTION_REFUSED;
    authError.connect_return_code = MQTT_CONNECTION_REFUSE_BAD_USERNAME;
    emitEvent(MQTT_EVENT_ERROR, 0, &authError);
    emitEvent(MQTT_EVENT_DISCONNECTED);
    Esp32BaseMqtt::handle(false);
    TEST_ASSERT_EQUAL(Esp32BaseMqtt::CONNECTION_REJECTED,
                      Esp32BaseMqtt::state());

    g_fakeWifiConnected = false;
    Esp32BaseMqtt::handle(false);
    TEST_ASSERT_EQUAL(Esp32BaseMqtt::CONNECTION_REJECTED,
                      Esp32BaseMqtt::state());
    g_fakeWifiConnected = true;
    Esp32BaseMqtt::handle(false);
    TEST_ASSERT_EQUAL(Esp32BaseMqtt::CONNECTION_REJECTED,
                      Esp32BaseMqtt::state());
    TEST_ASSERT_EQUAL_UINT32(1, Esp32BaseMqtt::diagnostics().connectAttempts);
}

void test_backoff_deadline_is_millis_wrap_safe() {
    TEST_ASSERT_TRUE(deadlineReached(3u, UINT32_MAX - 2u));
    TEST_ASSERT_FALSE(deadlineReached(UINT32_MAX - 3u, 2u));
}

} // namespace

void setUp() {
    resetModule();
}

void tearDown() {}

int main(int, char**) {
    UNITY_BEGIN();
#if ESP32BASE_MQTT_EXPECT_DATE_CHECK_REJECTION
    RUN_TEST(test_secure_default_rejects_missing_certificate_date_check);
#else
    RUN_TEST(test_configuration_requires_ca_and_rejects_plaintext_by_default);
    RUN_TEST(test_begin_never_starts_network_and_waits_for_prerequisites);
    RUN_TEST(test_callbacks_are_deferred_until_handle_and_subscriptions_repeat);
    RUN_TEST(test_qos1_publish_ack_and_outbox_limit);
    RUN_TEST(test_fragment_assembly_and_oversize_drop);
    RUN_TEST(test_terminal_auth_rejection_requires_explicit_retry);
    RUN_TEST(test_lwt_is_mapped_and_ota_suspends_without_direct_callback);
    RUN_TEST(test_before_connect_refreshes_lwt_for_every_attempt);
    RUN_TEST(test_before_connect_output_is_revalidated);
    RUN_TEST(test_native_before_connect_update_failure_is_terminal_until_retry);
    RUN_TEST(test_incoming_mailbox_full_drops_whole_message);
    RUN_TEST(test_connection_event_survives_full_control_mailbox);
    RUN_TEST(test_dns_and_certificate_errors_are_distinguished);
    RUN_TEST(test_reports_platform_certificate_date_check_capability);
    RUN_TEST(test_terminal_rejection_survives_wifi_loss_and_recovery);
    RUN_TEST(test_backoff_deadline_is_millis_wrap_safe);
#endif
    return UNITY_END();
}
